<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 10 changes.</summary>

```diff
# tailscale_tailnet_key.tailscale_key has been deleted
+ tailscale_tailnet_key.tailscale_key will be created
! module.debian13.proxmox_virtual_environment_vm.vm will be updated in-place
! module.debian13.terraform_data.creation_date will be updated in-place
! module.ubuntu22.proxmox_virtual_environment_vm.vm will be updated in-place
! module.ubuntu22.terraform_data.creation_date will be updated in-place
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be replaced due to changes in replace_triggered_by
! module.vm_minimal_config.terraform_data.combined_ci_hash will be updated in-place
! module.vm_minimal_config.terraform_data.creation_date will be updated in-place
! module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] must be replaced
! module.vm_minimal_config.module.cloud_init_files[0].random_id.random_id must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 6 to change, 3 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-15T02:26:09Z [(view log)](https://github.com/perchnet/p/actions/runs/16981396784/job/48141844645#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # tailscale_tailnet_key.tailscale_key has been deleted
  - resource "tailscale_tailnet_key" "tailscale_key" {
        id            = "kT33Jw1VUQ11CNTRL"
      - key           = (sensitive value) -> null
        tags          = [
            "tag:web-ingress",
        ]
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
      ~ description             = "Terraform VM created on 2025-08-15T02:14:03Z" -> (known after apply)
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.debian13.terraform_data.creation_date will be updated in-place
  ~ resource "terraform_data" "creation_date" {
        id     = "624a3070-1696-bafd-6384-89d2ae98bfd9"
      ~ input  = {
          ~ timestamp = "2025-08-15T02:14:03Z" -> (known after apply)
        }
      ~ output = {
          - timestamp = "2025-08-15T02:14:03Z"
        } -> (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
      ~ description             = "Terraform VM created on 2025-08-15T02:14:05Z" -> (known after apply)
        id                      = "131"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.ubuntu22.terraform_data.creation_date will be updated in-place
  ~ resource "terraform_data" "creation_date" {
        id     = "29b13aed-fac1-c676-a3ec-816da7002876"
      ~ input  = {
          ~ timestamp = "2025-08-15T02:14:05Z" -> (known after apply)
        }
      ~ output = {
          - timestamp = "2025-08-15T02:14:05Z"
        } -> (known after apply)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be replaced due to changes in replace_triggered_by
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ description             = "Terraform VM created on 2025-08-15T02:14:05Z" -> (known after apply)
      ~ id                      = "134" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:F0:44:19",
        ] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 134 -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "writeback" -> null
          - datastore_id      = "zssd" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-134-disk-0" -> null
          - replicate         = true -> null
          - size              = 20 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (sensitive value)
          + network_data_file_id = (sensitive value)
          ~ user_data_file_id    = (sensitive value)
          + vendor_data_file_id  = (sensitive value)
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:F0:44:19" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.terraform_data.combined_ci_hash will be updated in-place
  ~ resource "terraform_data" "combined_ci_hash" {
        id     = "5b2a8efd-c574-64c5-576f-a072826271ae"
      ~ input  = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ hash = (sensitive value)
        }
      ~ output = {
          - hash = "50c375"
        } -> (known after apply)
    }

  # module.vm_minimal_config.terraform_data.creation_date will be updated in-place
  ~ resource "terraform_data" "creation_date" {
        id     = "68d5d0a2-754a-4f7c-9123-e333a6c644b6"
      ~ input  = {
          ~ timestamp = "2025-08-15T02:14:05Z" -> (known after apply)
        }
      ~ output = {
          - timestamp = "2025-08-15T02:14:05Z"
        } -> (known after apply)
    }

  # module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] must be replaced
-/+ resource "proxmox_virtual_environment_file" "ci_user_data" {
      + file_modification_date = (known after apply)
      ~ file_name              = "0556309f7991f06b.user-data.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/0556309f7991f06b.user-data.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "0556309f7991f06b.user-data.yaml" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.vm_minimal_config.module.cloud_init_files[0].random_id.random_id must be replaced
-/+ resource "random_id" "random_id" {
      ~ b64_std     = "BVYwn3mR8Gs=" -> (known after apply)
      ~ b64_url     = "BVYwn3mR8Gs" -> (known after apply)
      ~ dec         = "384548279684296811" -> (known after apply)
      ~ hex         = "0556309f7991f06b" -> (known after apply)
      ~ id          = "BVYwn3mR8Gs" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "combined_ci_hash"                    = "50c375" -> (known after apply)
          ~ "short_ci_user_data_contents_hash"    = "OjO+vr" -> (known after apply)
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 6 to change, 3 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-48-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->